Roland665/MiniCar_Guet/MiniCar_V2.0/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C123/TM4C1230H6PM.svd
        <register>
          <name>LDOSPCTL</name>
          <description>LDO Sleep Power Control</description>
          <addressOffset>0x000001B4</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_LDOSPCTL_VLDO</name>
              <description>LDO Output Voltage</description>
              <bitRange>[7:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_LDOSPCTL_VLDO_0_90V</name>
                  <description>0.90 V</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOSPCTL_VLDO_0_95V</name>
                  <description>0.95 V</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOSPCTL_VLDO_1_00V</name>
                  <description>1.00 V</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOSPCTL_VLDO_1_05V</name>
                  <description>1.05 V</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOSPCTL_VLDO_1_10V</name>
                  <description>1.10 V</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOSPCTL_VLDO_1_15V</name>
                  <description>1.15 V</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOSPCTL_VLDO_1_20V</name>
                  <description>1.20 V</description>
                  <value>0x18</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_LDOSPCTL_VADJEN</name>
              <description>Voltage Adjust Enable</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LDODPCTL</name>
          <description>LDO Deep-Sleep Power Control</description>
          <addressOffset>0x000001BC</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_LDODPCTL_VLDO</name>
              <description>LDO Output Voltage</description>
              <bitRange>[7:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_LDODPCTL_VLDO_0_90V</name>
                  <description>0.90 V</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDODPCTL_VLDO_0_95V</name>
                  <description>0.95 V</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDODPCTL_VLDO_1_00V</name>
                  <description>1.00 V</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDODPCTL_VLDO_1_05V</name>
                  <description>1.05 V</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDODPCTL_VLDO_1_10V</name>
                  <description>1.10 V</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDODPCTL_VLDO_1_15V</name>
                  <description>1.15 V</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDODPCTL_VLDO_1_20V</name>
                  <description>1.20 V</description>
                  <value>0x18</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_LDODPCTL_VADJEN</name>
              <description>Voltage Adjust Enable</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPWD</name>
          <description>Watchdog Timer Peripheral Present</description>
          <addressOffset>0x00000300</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPWD_P0</name>
              <description>Watchdog Timer 0 Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPWD_P1</name>
              <description>Watchdog Timer 1 Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPTIMER</name>
          <description>16/32-Bit General-Purpose Timer Peripheral Present</description>
          <addressOffset>0x00000304</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPTIMER_P0</name>
              <description>16/32-Bit General-Purpose Timer 0 Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPTIMER_P1</name>
              <description>16/32-Bit General-Purpose Timer 1 Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPTIMER_P2</name>
              <description>16/32-Bit General-Purpose Timer 2 Present</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPTIMER_P3</name>
              <description>16/32-Bit General-Purpose Timer 3 Present</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPTIMER_P4</name>
              <description>16/32-Bit General-Purpose Timer 4 Present</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPTIMER_P5</name>
              <description>16/32-Bit General-Purpose Timer 5 Present</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPGPIO</name>
          <description>General-Purpose Input/Output Peripheral Present</description>
          <addressOffset>0x00000308</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPGPIO_P0</name>
              <description>GPIO Port A Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P1</name>
              <description>GPIO Port B Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P2</name>
              <description>GPIO Port C Present</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P3</name>
              <description>GPIO Port D Present</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P4</name>
              <description>GPIO Port E Present</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P5</name>
              <description>GPIO Port F Present</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P6</name>
              <description>GPIO Port G Present</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P7</name>
              <description>GPIO Port H Present</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P8</name>
              <description>GPIO Port J Present</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P9</name>
              <description>GPIO Port K Present</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P10</name>
              <description>GPIO Port L Present</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P11</name>
              <description>GPIO Port M Present</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P12</name>
              <description>GPIO Port N Present</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P13</name>
              <description>GPIO Port P Present</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P14</name>
              <description>GPIO Port Q Present</description>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPDMA</name>
          <description>Micro Direct Memory Access Peripheral Present</description>
          <addressOffset>0x0000030C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPDMA_P0</name>
              <description>uDMA Module Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPHIB</name>
          <description>Hibernation Peripheral Present</description>
          <addressOffset>0x00000314</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPHIB_P0</name>
              <description>Hibernation Module Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPUART</name>
          <description>Universal Asynchronous Receiver/Transmitter Peripheral Present</description>
          <addressOffset>0x00000318</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPUART_P0</name>
              <description>UART Module 0 Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPUART_P1</name>
              <description>UART Module 1 Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPUART_P2</name>
              <description>UART Module 2 Present</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPUART_P3</name>
              <description>UART Module 3 Present</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPUART_P4</name>
              <description>UART Module 4 Present</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPUART_P5</name>
              <description>UART Module 5 Present</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPUART_P6</name>
              <description>UART Module 6 Present</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPUART_P7</name>
              <description>UART Module 7 Present</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPSSI</name>
          <description>Synchronous Serial Interface Peripheral Present</description>
          <addressOffset>0x0000031C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPSSI_P0</name>
              <description>SSI Module 0 Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPSSI_P1</name>
              <description>SSI Module 1 Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPSSI_P2</name>
              <description>SSI Module 2 Present</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPSSI_P3</name>
              <description>SSI Module 3 Present</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPI2C</name>
          <description>Inter-Integrated Circuit Peripheral Present</description>
          <addressOffset>0x00000320</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPI2C_P0</name>
              <description>I2C Module 0 Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPI2C_P1</name>
              <description>I2C Module 1 Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPI2C_P2</name>
              <description>I2C Module 2 Present</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPI2C_P3</name>
              <description>I2C Module 3 Present</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPI2C_P4</name>
              <description>I2C Module 4 Present</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPI2C_P5</name>
              <description>I2C Module 5 Present</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPUSB</name>
          <description>Universal Serial Bus Peripheral Present</description>
          <addressOffset>0x00000328</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPUSB_P0</name>
              <description>USB Module Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPCAN</name>
          <description>Controller Area Network Peripheral Present</description>
          <addressOffset>0x00000334</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPCAN_P0</name>
              <description>CAN Module 0 Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPCAN_P1</name>
              <description>CAN Module 1 Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPADC</name>
          <description>Analog-to-Digital Converter Peripheral Present</description>
          <addressOffset>0x00000338</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPADC_P0</name>
              <description>ADC Module 0 Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPADC_P1</name>
              <description>ADC Module 1 Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPACMP</name>
          <description>Analog Comparator Peripheral Present</description>
          <addressOffset>0x0000033C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPACMP_P0</name>
              <description>Analog Comparator Module Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPPWM</name>
          <description>Pulse Width Modulator Peripheral Present</description>
          <addressOffset>0x00000340</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPPWM_P0</name>
              <description>PWM Module 0 Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPPWM_P1</name>
              <description>PWM Module 1 Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPQEI</name>
          <description>Quadrature Encoder Interface Peripheral Present</description>
          <addressOffset>0x00000344</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPQEI_P0</name>
              <description>QEI Module 0 Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPQEI_P1</name>
              <description>QEI Module 1 Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPEEPROM</name>
          <description>EEPROM Peripheral Present</description>
          <addressOffset>0x00000358</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPEEPROM_P0</name>
              <description>EEPROM Module Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPWTIMER</name>
          <description>32/64-Bit Wide General-Purpose Timer Peripheral Present</description>
          <addressOffset>0x0000035C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPWTIMER_P0</name>
              <description>32/64-Bit Wide General-Purpose Timer 0 Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPWTIMER_P1</name>
              <description>32/64-Bit Wide General-Purpose Timer 1 Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPWTIMER_P2</name>
              <description>32/64-Bit Wide General-Purpose Timer 2 Present</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPWTIMER_P3</name>
              <description>32/64-Bit Wide General-Purpose Timer 3 Present</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPWTIMER_P4</name>
              <description>32/64-Bit Wide General-Purpose Timer 4 Present</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPWTIMER_P5</name>
              <description>32/64-Bit Wide General-Purpose Timer 5 Present</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRWD</name>
          <description>Watchdog Timer Software Reset</description>
          <addressOffset>0x00000500</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRWD_R0</name>
              <description>Watchdog Timer 0 Software Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRWD_R1</name>
              <description>Watchdog Timer 1 Software Reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRTIMER</name>
          <description>16/32-Bit General-Purpose Timer Software Reset</description>
          <addressOffset>0x00000504</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRTIMER_R0</name>
              <description>16/32-Bit General-Purpose Timer 0 Software Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRTIMER_R1</name>
              <description>16/32-Bit General-Purpose Timer 1 Software Reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRTIMER_R2</name>
              <description>16/32-Bit General-Purpose Timer 2 Software Reset</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRTIMER_R3</name>
              <description>16/32-Bit General-Purpose Timer 3 Software Reset</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRTIMER_R4</name>
              <description>16/32-Bit General-Purpose Timer 4 Software Reset</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRTIMER_R5</name>
              <description>16/32-Bit General-Purpose Timer 5 Software Reset</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRGPIO</name>
          <description>General-Purpose Input/Output Software Reset</description>
          <addressOffset>0x00000508</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRGPIO_R0</name>
              <description>GPIO Port A Software Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R1</name>
              <description>GPIO Port B Software Reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R2</name>
              <description>GPIO Port C Software Reset</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R3</name>
              <description>GPIO Port D Software Reset</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R4</name>
              <description>GPIO Port E Software Reset</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R5</name>
              <description>GPIO Port F Software Reset</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R6</name>
              <description>GPIO Port G Software Reset</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
